#pragma once


char* ×Ö·û´®_Æ´½Ó(char* ×Ö·û´®1, char* ×Ö·û´®2);
int ×Ö·û´®_ÊÇ·ñ´æÔÚ(char* ×Ö·û´®, char* ×Ó×Ö·û´®);
char* ×Ö·û´®_Ìæ»»(char* Ô´×Ö·û´®, char* ±»Ìæ»»µÄ×Ö·û´®, char* Ìæ»»µÄ×Ö·û´®);
char* ×Ö·û´®_È¥³ý¿Õ¸ñ(char* ×Ö·û´®);
char** ×Ö·û´®_·Ö¸î(char* ×Ö·û´®, const char* ·Ö¸ô·û, int* ½á¹ûÊýÁ¿);
char* ×Ö·û´®_×ª´óÐ´(char* ×Ö·û´®);
char* ×Ö·û´®_×ªÐ¡Ð´(char* ×Ö·û´®);
char* ×Ö·û´®_È¥³ýÊ×Î²¿Õ¸ñ(char* ×Ö·û´®);
char* ×Ö·û´®_·´×ª×Ö·û´®( char* ×Ö·û´®);
char* ×Ö·û´®_×ªbase64(char* ×Ö·û´®);
char* ×Ö·û´®_´Óbase64»¹Ô­(char* ×Ö·û´®);
char* ×Ö·û´®_È¡MD5(char* ×Ö·û´®);
char* ×Ö·û´®_É¾³ýÖ¸¶¨Î»ÖÃµÄ×Ö·û(char* ×Ö·û´®, int ¿ªÊ¼Î»ÖÃ ,int ½áÊøÎ»ÖÃ);
